package vineteTask;

public class Demo {

	public static void main(String[] args) {
//		
//		 * 1. Създаване на бензиностанция с автоматично генерирани винетки. Да
//		 * се изведат на екрана, заедно с техните цена и цвят. - 5т.
//		 *  
//		 
		GasStation station = new GasStation();
//		 * 2.
//		 * Създаване на 20 шофьора с произволни имена. Да им се дадат произволна
//		 * стойност пари. Да им се зададе бензиностанция, от която да пазаруват
//		 * винетки. - 5т. 
//		 * 
		for(int i = 0; i < 20; i++) {
			//Driver  = new Driver(); random names
		}
		
//		 * 3. Създаване на 200 превозни средства от произволен
//		 * тип (кола, автобус, камион) и на всеки шофьор да се дадат по 10 от
//		 * тях като всяко превозно средство се управлява от един шофьор. - 10т.
//		 * 
//		 * 4. Всеки 3-ти шофьор на произволен принцип за някои превозни средства
//		 * да купи 5 винетки за произволно генериран срок (ден, месец, година).
//		 * Останалите шофьори да купят винетки за всичките си превозни средства
//		 * за произволно генериран срок. - 10т.
//		 *  
//		 * 5. Да се изведе информация за
//		 * всички шофьори – колко коли карат, колко от техните превозни средства
//		 * имат винетка с изтичащ срок за дадена дата и колко пари са им
//		 * останали. - 15т.
//		 *  
//		 * 6. Да се изведат всички останали винетки в
//		 * бензиностанцията в сортиран по цена ред. -5т. 7. Да се изведат всички
//		 * камиони, които имат изтекли винетки за дадена дата. -
//		 

	}

}
