package Shop;

public class DemoShop {

	public static void main(String[] args) {
//		 Да се реализира демо програма, която има следните възможности:
//			1. Създаване на магазин с предварително подадена вместимост от продукти;
//			2. Създаване на различни видове стоки на килограм –Месо, Сирене, Риба. Всяка стока се
//			създава с наименование, цена и количество;
//			3. Създаване на различни видове стоки на бройка –Бира, Книга, Стол. Всяка стока се
//			създава с наименование, цена и количество;
//			4. Добавяне на стоките в магазина;
//			5. Създаване на купувачи с предварително подадени магазин, брой продукти за
//			„ИТ Таланти“ ООД
//			ул. “Софийски герой” №1, ет. 11
//			София 1612
//			www.ittalents.bg тел.: +359 888 911 186
//			пазаруване и пари в наличност.
//			6. Добавяне на стоки към количката на купувачите;
//			7. Премахване на стоки от количката на купувачите;
//			8. Плащане от страна на купувачите на касата на магазина;
//			9. Визуализиране на наличностите в магазина преди и след като е пазарувал купувача.
//			10. Демото трябва да е така направено, че в никакъв случай да не се хвърля изключение, т.е.
//			всички изключения, които възникнат, да бъдат обработени. 

	}

}
