
public class Task01 {
	// Задача 1: Да се изведат на екрана числата от 1 до 100.
	public static void main(String[] args) {
		int x = 1;
		while (x <= 50) {
			System.out.println(x);
			x++;
		}
		// TODO Auto-generated method stub

	}

}
