
public class Task04 {
	// Задача 4: Да се изведат на екрана числата от 10 до 1 в обратен ред.
	public static void main(String[] args) {
		for (int x = 10; x >= 1; x--) {
			if (x == 1) {
				System.out.println(x);
			} else {
				System.out.print(x + ",");
			}
		}
		// TODO Auto-generated method stub

	}

}
